In [3]:
import pandas as pd
import numpy as np

In [4]:
import warnings
warnings.filterwarnings("ignore")

### Interpolate

In [32]:
of1=pd.read_csv("C:/Users/mitra/Desktop/INNOMATICS(MITRABHANU PANDA)/Python Class/Pandas/Dataset_Pandas/hyd_outliers.csv",na_values=[4450,1111,9999])

In [33]:
of1

          Date  Temp
0   21-01-2022  30.0
1   22-01-2022  28.0
2   23-01-2022   NaN
3   24-01-2022  29.0
4   25-01-2022   NaN
5   26-01-2022  32.0
6   27-01-2022  34.0
7   28-01-2022 -50.0
8   29-01-2022  36.0
9   30-01-2022  38.0
10  31-01-2022   NaN
11  13-02-2022  25.0
12  14-02-2022   NaN
13  15-02-2022  22.0
14  16-02-2022  21.0
15  17-02-2022   NaN
16  18-02-2022  22.0
17  19-02-2022   NaN
18  20-02-2022  20.0

In [34]:
pd.to_datetime(of1["Date"])

0    2022-01-21
1    2022-01-22
2    2022-01-23
3    2022-01-24
4    2022-01-25
5    2022-01-26
6    2022-01-27
7    2022-01-28
8    2022-01-29
9    2022-01-30
10   2022-01-31
11   2022-02-13
12   2022-02-14
13   2022-02-15
14   2022-02-16
15   2022-02-17
16   2022-02-18
17   2022-02-19
18   2022-02-20
Name: Date, dtype: datetime64[ns]

In [36]:
sf1=pd.read_csv("C:/Users/mitra/Desktop/INNOMATICS(MITRABHANU PANDA)/Python Class/Pandas/Dataset_Pandas/std_multinan.csv")

In [37]:
sf1

  Name  English  Science
0  AAA     50.0      40.0
1  BBB      NaN      45.0
2  CCC      NaN      58.0
3  DDD      NaN      90.0
4  EEE      NaN      55.0
5  NaN     40.0       NaN
6  GGG     45.0       NaN
7  NaN     58.0       NaN
8  KKK     90.0      90.0

In [38]:
sf1["English"]

0    50.0
1     NaN
2     NaN
3     NaN
4     NaN
5    40.0
6    45.0
7    58.0
8    90.0
Name: English, dtype: float64

In [39]:
sf1["English"].interpolate()

0    50.0
1    48.0
2    46.0
3    44.0
4    42.0
5    40.0
6    45.0
7    58.0
8    90.0
Name: English, dtype: float64

In [40]:
sf1["English"].interpolate(method="nearest")

0    50.0
1    50.0
2    50.0
3    40.0
4    40.0
5    40.0
6    45.0
7    58.0
8    90.0
Name: English, dtype: float64

In [43]:
sf2=pd.read_csv("C:/Users/mitra/Desktop/INNOMATICS(MITRABHANU PANDA)/Python Class/Pandas/Dataset_Pandas/Interpolate/std_interp.csv")

In [44]:
sf2

  Stdname  StdClass   Age
0     AAA        10  15.0
1     BBB        11   NaN
2     CCC        12  18.0
3     DDD        10   NaN
4     EEE        11  16.0
5     FFF        12  18.0
6     GGG        11  16.0
7     HHH        10  15.0
8     JJJ        12   NaN
9     KKK        10   NaN

In [46]:
sf2["Age"].interpolate(method="linear")

0    15.0
1    16.5
2    18.0
3    17.0
4    16.0
5    18.0
6    16.0
7    15.0
8    15.0
9    15.0
Name: Age, dtype: float64

In [47]:
sf2["Age"].interpolate(method="nearest")

0    15.0
1    15.0
2    18.0
3    18.0
4    16.0
5    18.0
6    16.0
7    15.0
8     NaN
9     NaN
Name: Age, dtype: float64

In [48]:
sf2["StdClass"]

0    10
1    11
2    12
3    10
4    11
5    12
6    11
7    10
8    12
9    10
Name: StdClass, dtype: int64

In [50]:
sf2=sf2.set_index(["StdClass"])

In [51]:
sf2

         Stdname   Age
StdClass
10           AAA  15.0
11           BBB   NaN
12           CCC  18.0
10           DDD   NaN
11           EEE  16.0
12           FFF  18.0
11           GGG  16.0
10           HHH  15.0
12           JJJ   NaN
10           KKK   NaN

In [52]:
sf2["Age"].interpolate(method="index")

StdClass
10    15.0
11    16.0
12    18.0
10    15.0
11    16.0
12    18.0
11    16.0
10    15.0
12    18.0
10    15.0
Name: Age, dtype: float64

### Dropna

In [53]:
df=pd.read_csv("C:\\Users\\mitra\\Desktop\\INNOMATICS(MITRABHANU PANDA)\\Python Class\\Pandas\\Dataset_Pandas\\Dropna\\std_dropna.csv")

In [54]:
df

   StdID StdName  Class Location  Total
0  111.0       A   10.0      viz  180.0
1  112.0       B   23.0      Viz    NaN
2  113.0     NaN   12.0      Blr  150.0
3    NaN     NaN    NaN      NaN    NaN
4  115.0       E   10.0      Viz    NaN
5    NaN       F   11.0      NaN  140.0
6  117.0       G    NaN      Hyd  188.0
7    NaN     NaN    NaN      NaN    NaN
8  119.0     NaN    9.0      Blr    NaN

In [55]:
df.dropna(how="any")

   StdID StdName  Class Location  Total
0  111.0       A   10.0      viz  180.0

In [56]:
df.dropna(how="all")

   StdID StdName  Class Location  Total
0  111.0       A   10.0      viz  180.0
1  112.0       B   23.0      Viz    NaN
2  113.0     NaN   12.0      Blr  150.0
4  115.0       E   10.0      Viz    NaN
5    NaN       F   11.0      NaN  140.0
6  117.0       G    NaN      Hyd  188.0
8  119.0     NaN    9.0      Blr    NaN

In [57]:
df.dropna(how="any",axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7, 8]

In [58]:
df["Class"]

0    10.0
1    23.0
2    12.0
3     NaN
4    10.0
5    11.0
6     NaN
7     NaN
8     9.0
Name: Class, dtype: float64

In [59]:
df["Class"].mode()

0    10.0
Name: Class, dtype: float64

In [62]:
df["Class"].mode()[0]

10.0

In [63]:
df["Class"].fillna(  df["Class"].mode()[0],  inplace=True)

In [64]:
df

   StdID StdName  Class Location  Total
0  111.0       A   10.0      viz  180.0
1  112.0       B   23.0      Viz    NaN
2  113.0     NaN   12.0      Blr  150.0
3    NaN     NaN   10.0      NaN    NaN
4  115.0       E   10.0      Viz    NaN
5    NaN       F   11.0      NaN  140.0
6  117.0       G   10.0      Hyd  188.0
7    NaN     NaN   10.0      NaN    NaN
8  119.0     NaN    9.0      Blr    NaN

In [65]:
df.dropna(how="any",axis=1)

   Class
0   10.0
1   23.0
2   12.0
3   10.0
4   10.0
5   11.0
6   10.0
7   10.0
8    9.0

In [67]:
df1=pd.read_csv("C:\\Users\\mitra\\Desktop\\INNOMATICS(MITRABHANU PANDA)\\Python Class\\Pandas\\Dataset_Pandas\\Dropna\\Dropna_set.csv")

In [68]:
df1

    Product ID     Product Name  Target   Amount
0          111               TV   100.0  45000.0
1          222            Table     NaN   5000.0
2          333       Dishwasher   100.0      NaN
3          444  Washing Machine   100.0  25000.0
4          555              NaN   100.0  15000.0
5          666     Refrigerator     NaN  30000.0
6          777          Blender   100.0      NaN
7          888              NaN   100.0   2000.0
8          999           Kettle   100.0   1500.0
9          112             Iron     NaN   1500.0
10         223              NaN   100.0   3000.0
11         334             Sofa     NaN   2000.0
12         445             Bike   100.0      NaN
13         556           Heater   100.0  10000.0
14         667              NaN   100.0   8000.0
15         778           Mobile     NaN  15000.0
16         889           Laptop   100.0  45000.0
17         114           Locker   100.0      NaN
18         224            Stove   100.0   8000.0

In [69]:
df1.dropna()

    Product ID     Product Name  Target   Amount
0          111               TV   100.0  45000.0
3          444  Washing Machine   100.0  25000.0
8          999           Kettle   100.0   1500.0
13         556           Heater   100.0  10000.0
16         889           Laptop   100.0  45000.0
18         224            Stove   100.0   8000.0

In [70]:
df1.dropna(subset="Product Name")

    Product ID     Product Name  Target   Amount
0          111               TV   100.0  45000.0
1          222            Table     NaN   5000.0
2          333       Dishwasher   100.0      NaN
3          444  Washing Machine   100.0  25000.0
5          666     Refrigerator     NaN  30000.0
6          777          Blender   100.0      NaN
8          999           Kettle   100.0   1500.0
9          112             Iron     NaN   1500.0
11         334             Sofa     NaN   2000.0
12         445             Bike   100.0      NaN
13         556           Heater   100.0  10000.0
15         778           Mobile     NaN  15000.0
16         889           Laptop   100.0  45000.0
17         114           Locker   100.0      NaN
18         224            Stove   100.0   8000.0

### Concat

In [72]:
dict1={
    "City":["Simla","Delhi","Jaypur","Bhopal"],
    "Temp":[25,56,34,23]
}

dict2={
    "City":["Chennai","Hyderabad","Vizag","Kochi"],
    "Temp":[39,45,23,34]
}

In [73]:
dict1

{'City': ['Simla', 'Delhi', 'Jaypur', 'Bhopal'], 'Temp': [25, 56, 34, 23]}

In [74]:
dict2

{'City': ['Chennai', 'Hyderabad', 'Vizag', 'Kochi'], 'Temp': [39, 45, 23, 34]}

In [75]:
c1=pd.DataFrame(dict1)

In [76]:
c2=pd.DataFrame(dict2)

In [77]:
display(c1,c2)

     City  Temp
0   Simla    25
1   Delhi    56
2  Jaypur    34
3  Bhopal    23

        City  Temp
0    Chennai    39
1  Hyderabad    45
2      Vizag    23
3      Kochi    34

In [79]:
ind=pd.concat([c1,c2])

In [80]:
ind

        City  Temp
0      Simla    25
1      Delhi    56
2     Jaypur    34
3     Bhopal    23
0    Chennai    39
1  Hyderabad    45
2      Vizag    23
3      Kochi    34

In [81]:
ind["City"][0]

0      Simla
0    Chennai
Name: City, dtype: object

In [82]:
ind.iloc[1]

City    Delhi
Temp       56
Name: 1, dtype: object

In [83]:
ind.loc[1]

        City  Temp
1      Delhi    56
1  Hyderabad    45

In [84]:
ind.iloc[5]

City    Hyderabad
Temp           45
Name: 1, dtype: object

In [85]:
ind1=pd.concat([c1,c2],ignore_index=True)

In [86]:
ind1

        City  Temp
0      Simla    25
1      Delhi    56
2     Jaypur    34
3     Bhopal    23
4    Chennai    39
5  Hyderabad    45
6      Vizag    23
7      Kochi    34

In [88]:
ind3=pd.concat([c1,c2],keys=["North","South"])

In [89]:
ind3

              City  Temp
North 0      Simla    25
      1      Delhi    56
      2     Jaypur    34
      3     Bhopal    23
South 0    Chennai    39
      1  Hyderabad    45
      2      Vizag    23
      3      Kochi    34

In [90]:
ind3.loc["North"]

     City  Temp
0   Simla    25
1   Delhi    56
2  Jaypur    34
3  Bhopal    23

In [91]:
ind3.loc["South"]

        City  Temp
0    Chennai    39
1  Hyderabad    45
2      Vizag    23
3      Kochi    34

In [94]:
a=ind3.loc["North"]["Temp"].mean()

In [97]:
a

34.5

In [95]:
b=ind3.loc["South"]["Temp"].mean()

In [98]:
b

35.25

In [100]:
c=ind3["Temp"].mean()

In [101]:
c

34.875

In [102]:
d=b-a

In [103]:
d

0.75

###

### Concat

In [104]:
dict3={
    "City":["Simla","Delhi","Jaypur","Bhopal"],
    "Temp":[25,56,34,23]
}

dict4={
    "City":["Chennai","Hyderabad","Vizag","Kochi"],
    "Humid":[67,75,83,54]
}

In [105]:
d1=pd.DataFrame(dict3)
d2=pd.DataFrame(dict4)

In [107]:
display(d1,d2)

     City  Temp
0   Simla    25
1   Delhi    56
2  Jaypur    34
3  Bhopal    23

        City  Humid
0    Chennai     67
1  Hyderabad     75
2      Vizag     83
3      Kochi     54

In [108]:
pd.concat([d1,d2]) # Default axis is 0.. Based on common Columns

        City  Temp  Humid
0      Simla  25.0    NaN
1      Delhi  56.0    NaN
2     Jaypur  34.0    NaN
3     Bhopal  23.0    NaN
0    Chennai   NaN   67.0
1  Hyderabad   NaN   75.0
2      Vizag   NaN   83.0
3      Kochi   NaN   54.0

In [109]:
pd.concat([d1,d2], axis=1) # Based on common index

     City  Temp       City  Humid
0   Simla    25    Chennai     67
1   Delhi    56  Hyderabad     75
2  Jaypur    34      Vizag     83
3  Bhopal    23      Kochi     54

In [110]:
dict5={
    "City":["Chennai","Hyderabad","Vizag","Kochi"],
    "Temp":[25,56,34,23]
}

dict6={
    "City":["Chennai","Hyderabad","Vizag","Kochi"],
    "Humid":[67,75,83,54]
}

In [111]:
d3=pd.DataFrame(dict5)
d4=pd.DataFrame(dict6)

In [113]:
display(d3,d4)

        City  Temp
0    Chennai    25
1  Hyderabad    56
2      Vizag    34
3      Kochi    23

        City  Humid
0    Chennai     67
1  Hyderabad     75
2      Vizag     83
3      Kochi     54

In [114]:
pd.concat([d3,d4])

        City  Temp  Humid
0    Chennai  25.0    NaN
1  Hyderabad  56.0    NaN
2      Vizag  34.0    NaN
3      Kochi  23.0    NaN
0    Chennai   NaN   67.0
1  Hyderabad   NaN   75.0
2      Vizag   NaN   83.0
3      Kochi   NaN   54.0

In [115]:
pd.concat([d3,d4],axis=1)

        City  Temp       City  Humid
0    Chennai    25    Chennai     67
1  Hyderabad    56  Hyderabad     75
2      Vizag    34      Vizag     83
3      Kochi    23      Kochi     54

##

In [116]:
d3.set_index("City",inplace=True)

In [117]:
d3

           Temp
City
Chennai      25
Hyderabad    56
Vizag        34
Kochi        23

In [118]:
d4.set_index("City",inplace=True)

In [119]:
d4

           Humid
City
Chennai       67
Hyderabad     75
Vizag         83
Kochi         54

In [121]:
ds=pd.concat([d3,d4],axis=1)

In [122]:
ds

           Temp  Humid
City
Chennai      25     67
Hyderabad    56     75
Vizag        34     83
Kochi        23     54

###

In [123]:
ds.reset_index()

        City  Temp  Humid
0    Chennai    25     67
1  Hyderabad    56     75
2      Vizag    34     83
3      Kochi    23     54

### Merge